uhnp/src/InformationRegisters/СкидкиТорговыхПредложенийВидыЦен/СкидкиТорговыхПредложенийВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиТорговыхПредложенийВидыЦен</name>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТорговоеПредложение</name>
    <type>
      <types>DefinedType.ТорговоеПредложение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидыЦен</name>
    <type>
      <types>DefinedType.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СкидкиТорговыхПредложенийВидыЦен/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСкидкиТорговыхПредложений(Параметры) Экспорт
	
	Если Параметры.ТорговоеПредложение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТорговоеПредложение = Параметры.ТорговоеПредложение;
	Опт = Параметры.Опт;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкидкиТорговыхПредложенийВидыЦен.ТорговоеПредложение КАК ТорговоеПредложение,
	|	СкидкиТорговыхПредложенийВидыЦен.Количество КАК Количество,
	|	СкидкиТорговыхПредложенийВидыЦен.ВидыЦен КАК ВидыЦен
	|ИЗ
	|	РегистрСведений.СкидкиТорговыхПредложенийВидыЦен КАК СкидкиТорговыхПредложенийВидыЦен
	|ГДЕ
	|	СкидкиТорговыхПредложенийВидыЦен.ТорговоеПредложение = &ТорговоеПредложение
	|	И СкидкиТорговыхПредложенийВидыЦен.Количество = 1";
	Запрос.УстановитьПараметр("ТорговоеПредложение", ТорговоеПредложение);
	
	Если Опт Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст, 
			"И СкидкиТорговыхПредложенийВидыЦен.Количество = 1", 
			"И СкидкиТорговыхПредложенийВидыЦен.Количество <> 1");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ДобавитьСкидкуТорговогоПредложения(ТорговоеПредложение, Скидка, Отказ, Удалить) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТорговоеПредложение.Установить(ТорговоеПредложение);
		НаборЗаписей.Отбор.ВидыЦен.Установить(Скидка);
		
		ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
		
		Если Удалить Тогда
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() Тогда
			
			ТекстСообщения = НСтр("ru = 'Выбранное значение скидки уже используется в скидках за опт';
									|en = 'Selected discount value is already used in wholesale discounts'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Скидка", , Отказ);
			ОтменитьТранзакцию();
			Возврат;
			
		КонецЕсли;
		
		СтрокаЗаписи = НаборЗаписей.Добавить();
		СтрокаЗаписи.ТорговоеПредложение = ТорговоеПредложение;
		СтрокаЗаписи.ВидыЦен = Скидка;
		СтрокаЗаписи.Количество = 1;
		
		НаборЗаписей.Записать(Ложь);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Торговые предложения.Добавление скидки торгового предложения.';
				|en = 'Selling propositions.Add a selling proposition discount.'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,, 
			"СкидкиТорговыхПредложенийВидыЦен.ДобавитьСкидкуТорговогоПредложения", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
